### Tópicos: Importando Biblioteca Pandas, lendo arquivo corretamente, retirando cabeçalho, renomeando cabeçalho, lendo arquivos txt e csv.

# Importando Biblioteca Pandas

In [16]:
#Importando a biblioteca Pandas

import pandas as pd

In [17]:
#Lendo o arquivo Sanduiches.txt

faturas = pd.read_table('Sanduiches.txt')

In [18]:
faturas.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [19]:
#Lendo o arquivo users.txt

usuarios = pd.read_table('Users.txt')

In [20]:
usuarios.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

## Observe que a leitura foi feita de maneira errada

In [21]:
#Podemos ler o arquivo colocando um separador

usuarios = pd.read_table('Users.txt', sep='|')

In [22]:
usuarios.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

## Temos que retirar o cabeçalho

In [23]:
usuarios = pd.read_table('Users.txt', sep='|', header=None)

In [24]:
usuarios.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [25]:
colunas = ['id','idade','sexo','profissao','cep']
usuarios = pd.read_table('users.txt', sep='|', header=None, names=colunas)

In [26]:
usuarios.head()

   id  idade sexo   profissao    cep
0   1     24    M  technician  85711
1   2     53    F       other  94043
2   3     23    M      writer  32067
3   4     24    M  technician  43537
4   5     33    F       other  15213

## Lendo outro tipo de arquivo

In [27]:
ufo = pd.read_csv('ufo.csv')

In [28]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00